package day17

import util.readInputOneLine

/**
 * --- 第 17 天：技巧射击 ---
 *
 * 你最终解码了小精灵们的信息。但消息上只是说了一句，“你好”。于是你继续搜寻你雪橇的钥匙。
 *
 * 在你的前方出现了一条巨大的 [海沟(ocean trench)](https://en.wikipedia.org/wiki/Oceanic_trench). 可能钥匙落入了其中？看来你最好发送一个探测仪来调查一下。
 *
 * 在你潜艇上的探测仪发射器可以以速度 x (向前) 和 y (向上，如果是负数则向下) 发出探测仪，x 和 y 均为 [整型(integer)](https://en.wikipedia.org/wiki/Integer) 速度。
 * 比如，以 `x,y` 初始速度 `0,10` 为例，将会直接向上方发射探测仪，而像 `10,-1` 这样的初始速度则会捎带着向下的倾角并向前发射探测仪。
 *
 * 以探测仪 `x,y` 的位置作为初始的 `0,0`, 然后在若干 **步骤(steps)** 中沿着某种轨迹移动。在每一步中，速度和位置的改变按着如下的顺序发生：
 *
 * - 把探测仪的 `x` 位置加上它的 `x` 速度。
 * - 把探测仪的 `y` 位置加上它的 `y` 速度。
 * - 由于阻力，探测仪的 `x` 速度会朝着 `0` 值的方向变动 `1`；也就是，如果它大于 `0` 则减少 `1`, 如果它小于 `0` 则增加 `1`, 如果已经是 `0` 了则不做改变。
 * - 由于重力，探测仪的 `y` 速度减少 `1` 。
 *
 * 为了能够将探测仪成功的发射到海沟中，探测仪的轨迹必须能够在经过若干步骤后处在 **目标区域(target area)** 的范围中。潜艇的电脑已经计算出了这个目标区域（这便是你的谜题输入）。
 * 比如：
 *
 * ```
 * target area: x=20..30, y=-10..-5
 * ```
 *
 * 这个目标区域意味着你需要找出这样一个初始速度 `x,y`, 使得探测仪能够在经过若干步骤后，它的 `x` 位置最小在 `20` 最大在 `30` 之间, **并且**
 * 探测仪的 `y` 位置最小在 `-10` 最大在 `-5` 之间。
 *
 * 根据给出的目标区域，经过若干步后能够将探测仪处于目标区域范围内的一种初始速度是 `7,2`:
 *
 * ```
 * .............#....#............
 * .......#..............#........
 * ...............................
 * S........................#.....
 * ...............................
 * ...............................
 * ...........................#...
 * ...............................
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTT#TT
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTTT
 * ```
 *
 * 在这个图形中, `S` 是探测仪初始位置，即 `0,0` 。 `x` 坐标 `x` 向右增加，而 `y` 坐标向上增加。在右下方，目标区域所覆盖的位置则用 `T` 表示。
 * 在此期间的每一步（到抵达目标区域为止），都用 `#` 标记。（右下角的 `#` 号既是探测仪的位置也是它抵达目标区域时的位置。）
 *
 * 另一个能够让探测仪经过若干步骤后处于目标区域的初始速度是 `6,3`:
 *
 * ```
 * ...............#..#............
 * ...........#........#..........
 * ...............................
 * ......#..............#.........
 * ...............................
 * ...............................
 * S....................#.........
 * ...............................
 * ...............................
 * ...............................
 * .....................#.........
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTTT
 * ....................T#TTTTTTTTT
 * ....................TTTTTTTTTTT
 * ```
 *
 * 还有一种是 `9,0`:
 *
 * ```
 * S........#.....................
 * .................#.............
 * ...............................
 * ........................#......
 * ...............................
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTT#
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTTT
 * ....................TTTTTTTTTTT
 * ```
 *
 * 还有一种速度它使得探测仪无论经过多少步骤，都 **不会** 在某步结束时处于目标区域的范围内，如 `17,-4`
 *
 * ```
 * S..............................................................
 * ...............................................................
 * ...............................................................
 * ...............................................................
 * .................#.............................................
 * ....................TTTTTTTTTTT................................
 * ....................TTTTTTTTTTT................................
 * ....................TTTTTTTTTTT................................
 * ....................TTTTTTTTTTT................................
 * ....................TTTTTTTTTTT..#.............................
 * ....................TTTTTTTTTTT................................
 * ...............................................................
 * ...............................................................
 * ...............................................................
 * ...............................................................
 * ................................................#..............
 * ...............................................................
 * ...............................................................
 * ...............................................................
 * ...............................................................
 * ...............................................................
 * ...............................................................
 * ..............................................................#
 * ```
 *
 * 探测仪看似是穿过了目标区域，但无论在哪步结束后都不会处于区域之中。相反，它会持续的向下和向右 - 上图只展示了其中最开始的几步。
 *
 * 如果你正准备从一个十分酷炫的探测仪发射器中，发出一个非常高科技的探测仪，你或许也想用某种有 **格调 (style)** 的方式来发射。你究竟可以让探测仪飞到多高但仍然能够落入到目标区域中？
 *
 * 在上面的例子中，使用初始速度 `6,9` 是你能够达到的最好情况，它使得探测仪能够抵达的最大 `y` 位置为 **45** 。（任何比这还高的初始 `y` 都会导致探测仪完全飞出目标区域、）
 *
 * 第一个问题：找出能够使得探测仪达到最高 `y` 位置的初始速度，且在经过若干步骤后依然能够完全处于目标区域的范围中。**按照这个轨迹你能到达的最高的 `y` 位置是多少？**
 *
 * --- 第二部分 ---
 *
 * 或许花里胡哨的发射不是最好的主意；毕竟，你只有一台探测仪，所以你最好别搞不见了。
 *
 * 为了能够获得发射探测仪的最佳选项，你需要找出经过若干步骤后。能够使得探测仪最终位于目标区域中的 **全部初始速度**。
 *
 * 在上面的例子中，总共有 **112** 种不同的初始速度值可以满足落入目标区域的要求：
 *
 * ```
 * 23,-10  25,-9   27,-5   29,-6   22,-6   21,-7   9,0     27,-7   24,-5
 * 25,-7   26,-6   25,-5   6,8     11,-2   20,-5   29,-10  6,3     28,-7
 * 8,0     30,-6   29,-8   20,-10  6,7     6,4     6,1     14,-4   21,-6
 * 26,-10  7,-1    7,7     8,-1    21,-9   6,2     20,-7   30,-10  14,-3
 * 20,-8   13,-2   7,3     28,-8   29,-9   15,-3   22,-5   26,-8   25,-8
 * 25,-6   15,-4   9,-2    15,-2   12,-2   28,-9   12,-3   24,-6   23,-7
 * 25,-10  7,8     11,-3   26,-7   7,1     23,-9   6,0     22,-10  27,-6
 * 8,1     22,-8   13,-4   7,6     28,-6   11,-4   12,-4   26,-9   7,4
 * 24,-10  23,-8   30,-8   7,0     9,-1    10,-1   26,-5   22,-9   6,5
 * 7,5     23,-6   28,-10  10,-2   11,-1   20,-9   14,-2   29,-7   13,-3
 * 23,-5   24,-8   27,-9   30,-7   28,-5   21,-10  7,9     6,6     21,-5
 * 27,-10  7,2     30,-9   21,-8   22,-7   24,-9   20,-6   6,9     29,-5
 * 8,-2    27,-8   30,-5   24,-7
 * ```
 *
 * 第二个问题：**有多少种不同的初始速度值，能够让探测仪经过若干步骤后得以落入到目标区域中？**
 */
fun main() {
    // 第一个问题
    fun part1(input: String): Int {
        TODO()
    }

    // 第二个问题
    fun part2(input: String): Int {
        TODO()
    }

    val testInput = readInputOneLine("day17_test")
    check(part1(testInput) == 45)
//    check(part2(testInput) == )

    val input = readInputOneLine("day17")
    check(part1(input) == 112)
//    check(part2(input) == )
}